# GlazingBackfaceCulling Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedGlazing..::..GlazingBackfaceCulling Property
AdvancedGlazing Class See Also
---
The property labeled "Backface Culling" from the "AdvancedGlazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static string GlazingBackfaceCulling { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlazingBackfaceCulling As String
	Get
```

Visual C++
---
```text
public:
static property String^ GlazingBackfaceCulling {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace